I tested the following scenarios:
```hcl
topics = [
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_10"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_10"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_20"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_20"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]: Creation complete after 4s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_20]
module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]: Creation complete after 4s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_10]
```

---

Adding a topic to the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_0"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_0"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Creation complete after 3s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_0]
```

---

Adding a topic to the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```

```

`terraform apply` output:
```

```

---

Adding a topic to the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```

```

`terraform apply` output:
```

```

---

Adding a topic to the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```

```

`terraform apply` output:
```

```

---

Adding a topic to the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```

```

`terraform apply` output:
```

```